Revit 2027 API
ScheduleDefinition.GetFieldId Method
 Converts a field index to the corresponding field ID.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFieldId GetFieldId(
	int index
)
Public Function GetFieldId (
	index As Integer
) As ScheduleFieldId
public:
ScheduleFieldId^ GetFieldId(
	int index
)
member GetFieldId :
        index : int -> ScheduleFieldId
Parameters
index Int32
 The field index.
Return Value
ScheduleFieldId
 The field ID.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  index is not a valid field index in this ScheduleDefinition.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace